[
    {
        "name": "Move to Oracle Cloud",
        "id": 1202100,
        "category": "START",
        "rationales": {},
        "remediations": {},
        "populations": {},
        "description": "",
        "impacts": [],
        "effort": null,
        "parents": [],
        "children": [
            1202101
        ]
    },
    {
        "name": "Oracle Database to Oracle Cloud Database",
        "id": 1202101,
        "category": "BRANCHING-STEP",
        "rationales": {
            "Agnostic": "Recommendations to move your Oracle Database to Oracle Cloud Database"
        },
        "remediations": {},
        "populations": {},
        "description": "",
        "impacts": [],
        "effort": null,
        "parents": [
            1202100
        ],
        "children": [
            1202102,
            1202103,
            1202104
        ]
    },
    {
        "name": "Oracle Database to Oracle Cloud Database with Object Type Remediation",
        "id": 1202103,
        "category": "BRANCHING-STEP",
        "rationales": {
            "Agnostic": "Recommendations to replatform Oracle Database to Oracle Cloud Database that will require object type remediation."
        },
        "remediations": {},
        "populations": {
            "Mainframe": "Check if any violation for rules with TC 61033 and with tag AIP-M2C-ObjectType"
        },
        "description": "This rule checks unsupported object types when moving oracle Database to Oracle Cloud Database",
        "impacts": [
            "replatform",
            "review"
        ],
        "effort": "high",
        "parents": [
            1202101
        ],
        "children": [
            1106000,
            1106016,
            1106018
        ]
    },
    {
        "name": "Oracle Database to Oracle Cloud Database with Syntax Remediation",
        "id": 1202104,
        "category": "BRANCHING-STEP",
        "rationales": {
            "Agnostic": "Recommendations to replatform Oracle Database to Oracle Cloud Database that will require syntax change remediation."
        },
        "remediations": {},
        "populations": {
            "Mainframe": "Check if any violation for rules with TC 61033 and with tag AIP-M2C-Syntax"
        },
        "description": "This rule checks unsupported syntaxes when moving oracle Database to Oracle Cloud Database",
        "impacts": [
            "replatform",
            "review"
        ],
        "effort": "low",
        "parents": [
            1202101
        ],
        "children": [
            1106024,
            1106028,
            1106030
        ]
    },
    {
        "name": "Oracle Database to Oracle Cloud Database with Data Type Remediation",
        "id": 1202102,
        "category": "BRANCHING-STEP",
        "rationales": {
            "Agnostic": "Recommendations to replatform Oracle Database to Oracle Cloud Database that will require data type remediation."
        },
        "remediations": {},
        "populations": {
            "SQL": "",
            "Mainframe": "Check if any violation for rules with TC 61033 and with tag AIP-M2C-DataType"
        },
        "description": "This rule checks unsupported Data types when moving oracle Database to Oracle Cloud Database",
        "impacts": [
            "replatform"
        ],
        "effort": "moderate",
        "parents": [
            1202101
        ],
        "children": [
            1106004,
            1106026,
            1106032
        ]
    },
    {
        "name": "Ensure SHARDED tables are not used",
        "id": 1106024,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Oracle Autonomous Database supports most of the features present in Oracle Database Enterprise Edition.\nHowever, to ensure the security and the performance of Autonomous Database.\nSome Oracle Database features, options, and packs are not supported in Autonomous Database as Clusters (groups of tables). This is why Oracle Sharding is NOT supported by Oracle Autonomous Database Cloud."
        },
        "remediations": {
            "Agnostic": "Do not use SHARDED tables."
        },
        "populations": null,
        "description": "This rule checks the usage of SHARDED clause in CREATE TABLE statements for Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202104
        ],
        "children": []
    },
    {
        "name": "Ensure CLOB data type is not used",
        "id": 1106004,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Autonomous Database supports most of the features present in Oracle Database Enterprise Edition. However, to ensure the security and the performance of Autonomous Database, some Oracle Database features, options, and packs are not supported in Autonomous Database as CLOB Storage."
        },
        "remediations": {
            "Agnostic": "CLOB Data Type can be converted into VARCHAR2.\nTO_CLOB explicit conversion function TO_CLOB which convert other data types to CLOB."
        },
        "populations": null,
        "description": "This rule checks the usage of CLOB Storage and the explicit conversion function TO_CLOB which convert other data types to CLOB.",
        "impacts": [],
        "effort": null,
        "parents": [
            1202102
        ],
        "children": []
    },
    {
        "name": "Ensure unsupported PL/SQL packages are not used",
        "id": 1106000,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Autonomous Database supports most of the features present in Oracle Database Enterprise Edition.\nHowever, to ensure the security and the performance of Autonomous Database, Some Oracle Database features, options, and packs are not supported in Autonomous Database as following PL/SQL packages\n- UTL_TCP\n- UTL_INADDR\n- DBMS_DEBUG\n- DBMS_DEBUG_JDWP\n- DBMS_DEBUG_JDWP_CUSTOM\n- DBMS_LDAP"
        },
        "remediations": {
            "Agnostic": "Check your code and if so, move the functionality on the client side (Java, other)."
        },
        "populations": null,
        "description": "This rule checks if UTL_TCP, UTL_INADDR, DBMS_LDAP, DBMS_DEBUG, DBMS_DEBUG_JDWP, DBMS_DEBUG_JDWP_CUSTOM PL/SQL packages are used in Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202103
        ],
        "children": []
    },
    {
        "name": "Ensure PL/SQL packages UTL_HTTP and UTL_SMTP are not used",
        "id": 1106016,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Autonomous Database supports most of the features present in Oracle Database Enterprise Edition.\nHowever, to ensure the security and the performance of Autonomous Database, Some Oracle Database features, options, and packs are not supported in Autonomous Database like or the support is limited, as for UTL_HTTP and UTL_SMTP PL/SQL Packages."
        },
        "remediations": {
            "Agnostic": "The following describes notes to consider before, during, and after using PL/SQL packages in dedicated Autonomous Databases.\n\n\nUTL_HTTP\n- Connections through IP addresses are allowed.\n- Egress ports 80 and 443 are enabled by default.\n- HTTP, HTTPS, and HTTP_PROXY connections are allowed.\n- The APEX_WEB_SERVICE PL/SQL package is layered on UTL_HTTP.\n- Before invoking the UTL_HTTP subprograms, you must first set the wallet location using the SET_WALLET subprogram. As this is a session level setting, you must set it before each session as following: \nBEGIN\n  UTL_HTTP.SET_WALLET(path => 'file:/var/opt/oracle/dbaas_acfs/grid/tcps_wallets');\nEND;\n/\n\n--------------------------\nUTL_SMTP \n- Connections through IP addresses are allowed.\n- Egress ports 25, 465, 587, and 2525 are enabled by default.\n- Both simple and secure (SSL) SMTP endpoints are accessible.\n- Oracle Cloud Infrastructure (OCI) Email Delivery Service and third-party SMTP servers are both supported as email providers. However, unlike Oracle Enterprise Edition on-premises database, you cannot set up localhost as the SMTP server. The sendmail() service is also disabled on the platform.\n- The APEX_MAIL PL/SQL package is layered on UTL_SMTP.\n\n\n\n\nFor more information please refer to https://docs.oracle.com/en/database/oracle/oracle-database/19/arpls/UTL_HTTP.html and \nhttps://docs.oracle.com/en/database/oracle/oracle-database/19/arpls/UTL_HTTP.html#GUID-CE6A8141-23EE-4907-9783-DDF4624BCC29"
        },
        "populations": null,
        "description": "This rule checks if the UTL_HTTP or UTL_SMTP PL/SQL packages are used in Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202103
        ],
        "children": []
    },
    {
        "name": "Ensure INDEX-ORGANIZED TABLEs (IOT) are not used",
        "id": 1106030,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Index-organized tables are not supported."
        },
        "remediations": {
            "Agnostic": "Index-organized tables are not supported, but attempting to create one does not generate an error. Instead, a heap-organized table with a primary key index is created. Therefore, if you use index-organized tables, you should test the applications that use index-organized tables to confirm that they work using heap-organized tables with a primary key indexes."
        },
        "populations": null,
        "description": "This rule checks the usage of ORGANIZATION INDEX clause in the CREATE TABLE statement in Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202104
        ],
        "children": []
    },
    {
        "name": "Ensure CLUSTER clause in CREATE TABLE statements is not used",
        "id": 1106028,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Autonomous Database supports most of the features present in Oracle Database Enterprise Edition.\nHowever, to ensure the security and the performance of Autonomous Database, Clusters (groups of tables) are no longer supported."
        },
        "remediations": {
            "Agnostic": "Do not use CLUSTERED tables."
        },
        "populations": null,
        "description": "This rule checks the usage of CLUSTER clause in the CREATE TABLE statement in Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202104
        ],
        "children": []
    },
    {
        "name": "Ensure ROWID data type is not used",
        "id": 1106032,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Autonomous Database allows most of the data types available in Oracle Database. To ensure the security and the performance of Autonomous Database, some data types are restricted. In dedicated deployments, the ROWID data type is not enabled by default. You can enable it by setting the ALLOW_ROWID_COLUMN_TYPE initialization parameter to true.\n\nHowever, if you enable it, be aware that ROWID columns are incompatible with rolling upgrade operations and other internal operations that physically move a row. \n\nAt a minimum, database activities involving ROWID should be suspended during upgrades. Applications using ROWID columns should introduce correctness validation to mitigate against logical errors in the application if a row relocates."
        },
        "remediations": {
            "Agnostic": "Do not use ROWID data types and pseudocolumns."
        },
        "populations": null,
        "description": "This rule checks the usage of ROWID data type and ROWID pseudocolumn Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202102
        ],
        "children": []
    },
    {
        "name": "Ensure PL/SQL procedures DBMS_LOGMNR.ADD_LOGFILE and DBMS_LOGMNR.REMOVE_LOGFILE are not used",
        "id": 1106018,
        "category": "TASK",
        "rationales": {
            "Agnostic": "Oracle Autonomous Database supports LogMiner, with limitations."
        },
        "remediations": {
            "Agnostic": "Autonomous Database on Dedicated Exadata Infrastructure supports LogMiner, with the following limitations:\n- The DBMS_LOGMNR.ADD_LOGFILE and DBS_LOGMNR.REMOVE_LOGFILE procedures can not be used from an Autonomous Database.\n- The dbms_logmnr.start_logmnr procedure can only be invoked with SCN or time range parameters. Querying the V$LOGMNR_CONTENTS view subsequently returns the data from the specified SCN or time range for the connected Autonomous Database.\n- Only one LogMiner session is allowed per Autonomous Database.\n- By default, Autonomous Database archived log files are kept for up to:\n      - 3 days for databases without GoldenGate capture and Autonomous Data Guard setup.\n      - 7 days for databases with Autonomous Data Guard that do not have GoldenGate capture enabled.\n      - 15 days for databases with GoldenGate capture enabled. \n     Therefore, LogMiner can only access up to 3, 7, or 15 days of archived log files as per the above list.\n     The log files retention period depends on the database transaction rate and is not always guaranteed up to the number of days specified above. There can be instances when you attempt to mine unavailable log files. In such cases, LogMiner reports ORA-1285: \"error reading file\"."
        },
        "populations": null,
        "description": "This rule checks if the DBMS_LOGMNR.ADD_LOGFILE and DBMS_LOGMNR.REMOVE_LOGFILE procedures are used in Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202103
        ],
        "children": []
    },
    {
        "name": "Ensure XMLType columns are not used",
        "id": 1106026,
        "category": "TASK",
        "rationales": {
            "Agnostic": "To ensure the security and the performance of Autonomous Database, some Oracle XML DB are restricted. This is why you should review Tables with XMLType columns"
        },
        "remediations": {
            "Agnostic": "If you migrate tables containing XMLType columns to Autonomous Database using Oracle Data Pump, you need to convert to Non-Schema Binary XML prior to using Oracle Data Pump Export (expdp)."
        },
        "populations": null,
        "description": "This rule checks if any table contains XMLType columns in Oracle Database(s).",
        "impacts": [],
        "effort": null,
        "parents": [
            1202102
        ],
        "children": []
    }
]